---
kind: property
id: P:Autodesk.Revit.DB.Events.DocumentReloadLatestProgressChangedEventArgs.ReloadLatestFinished
source: html/2e392938-ee2a-69e6-3afd-f8232751ea23.htm
---
# Autodesk.Revit.DB.Events.DocumentReloadLatestProgressChangedEventArgs.ReloadLatestFinished Property

Indicates if current 'reload latest' progress is finished.

## Syntax (C#)
```csharp
public bool ReloadLatestFinished { get; }
```